# EndModeButtonsText

## Description
Ends the creation of a mode bar buttons help text.

```pascal
PROCEDURE EndModeButtonsText;
```

```python
def vs.EndModeButtonsText():
    return None
```

## Examples
```pascal
BeginModeButtonsText;
SetModeButtonText( 'Mode1', 1 );
SetModeButtonText( 'Mode2', 0 );
EndModeButtonsText;
```

```pascal
EndModeButtonsText;
```
```python
import vs

# Ends the creation of a mode bar buttons help text.
vs.EndModeButtonsText()
```

## See Also
VS Functions:
BeginModeButtonsText
| SetModeButtonText

## Version
Availability: from Vectorworks 2013

## Category
* User Interactive